app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "last_name", "mail", "name", "password", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    user =  User.new(user_attributes)
    if user.valid?
      User.create!(user_attributes)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "47"]]
UPDATE "users" SET "name" = $1, "last_name" = $2, "mail" = $3, "password" = $4, "updated_at" = $5 WHERE "users"."id" = 63  [["name", "Daniel"], ["last_name", "Lopez Lopez"], ["mail", "Lopez Lopez"], ["password", "elmeneito"], ["updated_at", Tue, 03 Dec 2013 19:21:29 UTC +00:00]]
---
  def update
    #This is ugly but I'm run out of time
    user = User.find(params[:id])
    if  user_attributes[:old_password] == user.password
      new_user = user_attributes
      user.update_attributes(name: new_user[:name], last_name: new_user[:last_name], mail: new_user[:mail], password: new_user[:password])